app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-11-28 00:51:34.916903"], ["updated_at", "2018-11-28 00:51:34.916903"]]
---
  def create
    @school_class = SchoolClass.create(post_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(post_params)