app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Risk Analysis"], ["room_number", 10], ["created_at", "2018-11-28 04:04:26.525388"], ["updated_at", "2018-11-28 04:04:26.525388"]]
---
    def update
        @school_class = SchoolClass.new(school_class_params)
        @school_class.save