app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2016-06-10 23:05:51.902668"], ["id", 1]]
---
    def update
        find_student
        @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
    def find_student
        @student = Student.find_by_id(params[:id])